In [1]:
import numpy as np
import pandas as pd
rg = np.random.default_rng()

# 10 minutes to pandas

## Object creation

Intro to data structures section: https://pandas.pydata.org/docs/user_guide/dsintro.html#dsintro

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20221006", periods=6, freq='12H')
dates

DatetimeIndex(['2022-10-06 00:00:00', '2022-10-06 12:00:00',
               '2022-10-07 00:00:00', '2022-10-07 12:00:00',
               '2022-10-08 00:00:00', '2022-10-08 12:00:00'],
              dtype='datetime64[ns]', freq='12H')

In [4]:
df = pd.DataFrame(rg.random((6, 4)) * 10, index=dates, columns=list("ABCD")).astype(int) #astype("int") is also available
df

                     A  B  C  D
2022-10-06 00:00:00  0  3  1  4
2022-10-06 12:00:00  2  9  2  9
2022-10-07 00:00:00  7  3  5  4
2022-10-07 12:00:00  1  2  5  8
2022-10-08 00:00:00  6  7  1  9
2022-10-08 12:00:00  7  0  3  3

In [5]:
df2 = pd.DataFrame({
    "A": 1.0,
    "B": pd.Timestamp("20221006"),
    "C": pd.Series(1, index=list(range(4)), dtype="float32"),
    "D": np.array([3] * 4, dtype="int32"),
    "E": pd.Categorical(["test", "train", "test", "train"]),
    "F": "foo",
})
df

                     A  B  C  D
2022-10-06 00:00:00  0  3  1  4
2022-10-06 12:00:00  2  9  2  9
2022-10-07 00:00:00  7  3  5  4
2022-10-07 12:00:00  1  2  5  8
2022-10-08 00:00:00  6  7  1  9
2022-10-08 12:00:00  7  0  3  3

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2022-10-06 00:00:00,2022-10-06 00:00:00,2022-10-06 00:00:00,2022-10-06 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [8]:
df2.to_numpy() # this operation will be expensive because df2's columns have different data types

array([[1.0, Timestamp('2022-10-06 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2022-10-06 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2022-10-06 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2022-10-06 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [9]:
df2.T.to_numpy().dtype # dtype('O') means (Python) objects
# 'b'       boolean
# 'i'       (signed) integer
# 'u'       unsigned integer
# 'f'       floating-point
# 'c'       complex-floating point
# 'O'       (Python) objects
# 'S', 'a'  (byte-)string
# 'U'       Unicode
# 'V'       raw data (void)

dtype('O')

## Viewing Data

Basic sections: https://pandas.pydata.org/docs/user_guide/basics.html#basics

In [10]:
df.head()

                     A  B  C  D
2022-10-06 00:00:00  0  3  1  4
2022-10-06 12:00:00  2  9  2  9
2022-10-07 00:00:00  7  3  5  4
2022-10-07 12:00:00  1  2  5  8
2022-10-08 00:00:00  6  7  1  9

In [11]:
df.tail(3)

                     A  B  C  D
2022-10-07 12:00:00  1  2  5  8
2022-10-08 00:00:00  6  7  1  9
2022-10-08 12:00:00  7  0  3  3

In [12]:
df.index

DatetimeIndex(['2022-10-06 00:00:00', '2022-10-06 12:00:00',
               '2022-10-07 00:00:00', '2022-10-07 12:00:00',
               '2022-10-08 00:00:00', '2022-10-08 12:00:00'],
              dtype='datetime64[ns]', freq='12H')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.to_numpy() # columns를 제외하고 변환시키는 것 같음

array([[0, 3, 1, 4],
       [2, 9, 2, 9],
       [7, 3, 5, 4],
       [1, 2, 5, 8],
       [6, 7, 1, 9],
       [7, 0, 3, 3]])

In [15]:
df.describe()

              A        B         C         D
count  6.000000  6.00000  6.000000  6.000000
mean   3.833333  4.00000  2.833333  6.166667
std    3.188521  3.34664  1.834848  2.786874
min    0.000000  0.00000  1.000000  3.000000
25%    1.250000  2.25000  1.250000  4.000000
50%    4.000000  3.00000  2.500000  6.000000
75%    6.750000  6.00000  4.500000  8.750000
max    7.000000  9.00000  5.000000  9.000000

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2022-10-06 00:00:00 to 2022-10-08 12:00:00
Freq: 12H
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      int32
 1   B       6 non-null      int32
 2   C       6 non-null      int32
 3   D       6 non-null      int32
dtypes: int32(4)
memory usage: 144.0 bytes

In [17]:
df.sort_index(axis=1, ascending=False)

                     D  C  B  A
2022-10-06 00:00:00  4  1  3  0
2022-10-06 12:00:00  9  2  9  2
2022-10-07 00:00:00  4  5  3  7
2022-10-07 12:00:00  8  5  2  1
2022-10-08 00:00:00  9  1  7  6
2022-10-08 12:00:00  3  3  0  7

In [18]:
df.sort_values(by="D")

                     A  B  C  D
2022-10-08 12:00:00  7  0  3  3
2022-10-06 00:00:00  0  3  1  4
2022-10-07 00:00:00  7  3  5  4
2022-10-07 12:00:00  1  2  5  8
2022-10-06 12:00:00  2  9  2  9
2022-10-08 00:00:00  6  7  1  9

## Selection

Indexing and Selecting Data: https://pandas.pydata.org/docs/user_guide/indexing.html#indexing  
MultiIndex / Advanced Indexing: https://pandas.pydata.org/docs/user_guide/advanced.html#advanced

### Note
optimized pandas data access methods:  
`DataFrame.at`, `DataFrame.iat`, `DataFrame.loc`, `DataFrame.iloc`

### Getting

In [19]:
df["A"] is df.A # selecting a single column

True

In [20]:
try: df["A", 0]
except KeyError as e: print(e)

('A', 0)

In [21]:
df[0:3] # __getitem__: slices the rows

                     A  B  C  D
2022-10-06 00:00:00  0  3  1  4
2022-10-06 12:00:00  2  9  2  9
2022-10-07 00:00:00  7  3  5  4

In [22]:
df["2022-10-06 00:00:00":"2022-10-07 18:00:00"]

                     A  B  C  D
2022-10-06 00:00:00  0  3  1  4
2022-10-06 12:00:00  2  9  2  9
2022-10-07 00:00:00  7  3  5  4
2022-10-07 12:00:00  1  2  5  8

### Selection by label

Selection by Label: https://pandas.pydata.org/docs/user_guide/indexing.html#indexing-label

In [23]:
df.loc[dates[0]]

A    0
B    3
C    1
D    4
Name: 2022-10-06 00:00:00, dtype: int32

In [24]:
df.loc[..., ["A", "B"]]

                     A  B
2022-10-06 00:00:00  0  3
2022-10-06 12:00:00  2  9
2022-10-07 00:00:00  7  3
2022-10-07 12:00:00  1  2
2022-10-08 00:00:00  6  7
2022-10-08 12:00:00  7  0

In [25]:
df.loc["2022-10-06 00:00:00":"2022-10-07 11:59:59", ["C", "D"]] # watch out for pd.errors.OutOfBoundsDatetime

                     C  D
2022-10-06 00:00:00  1  4
2022-10-06 12:00:00  2  9
2022-10-07 00:00:00  5  4

In [26]:
df.loc[dates[0], "A"]

0

In [27]:
df.at[dates[0], "A"] # get a scalar faster than DataFrame.loc()

0

### Selection by position

Selection by Position: https://pandas.pydata.org/docs/user_guide/indexing.html#indexing-integer

In [28]:
df.iloc[3] # df.loc[dates[i]]랑 df.iloc[i]랑 같은 듯

A    1
B    2
C    5
D    8
Name: 2022-10-07 12:00:00, dtype: int32

In [29]:
df.iloc[3:5, 0:2] # numpy와 비슷한 슬라이싱 가능한 듯

                     A  B
2022-10-07 12:00:00  1  2
2022-10-08 00:00:00  6  7

In [30]:
df.iloc[[1, 2, 4], [0, 2]]

                     A  C
2022-10-06 12:00:00  2  2
2022-10-07 00:00:00  7  5
2022-10-08 00:00:00  6  1

In [31]:
df.iloc[:, 1:3]

                     B  C
2022-10-06 00:00:00  3  1
2022-10-06 12:00:00  9  2
2022-10-07 00:00:00  3  5
2022-10-07 12:00:00  2  5
2022-10-08 00:00:00  7  1
2022-10-08 12:00:00  0  3

In [32]:
df.iloc[1, 1]

9

In [33]:
df.iat[1, 1] # get a scalar faster than DataFrame.iloc()

9

### Boolean indexing

In [34]:
df[df["A"] > 5]

                     A  B  C  D
2022-10-07 00:00:00  7  3  5  4
2022-10-08 00:00:00  6  7  1  9
2022-10-08 12:00:00  7  0  3  3

In [35]:
df[df > 5]

                       A    B   C    D
2022-10-06 00:00:00  NaN  NaN NaN  NaN
2022-10-06 12:00:00  NaN  9.0 NaN  9.0
2022-10-07 00:00:00  7.0  NaN NaN  NaN
2022-10-07 12:00:00  NaN  NaN NaN  8.0
2022-10-08 00:00:00  6.0  7.0 NaN  9.0
2022-10-08 12:00:00  7.0  NaN NaN  NaN

In [36]:
df3 = df.copy()

In [37]:
df3["E"] = ["one", "one", "two", "three", "four", "three"]

In [38]:
df3[df3["E"].isin(["two", "four"])]

            A  B  C  D     E
2022-10-07  7  3  5  4   two
2022-10-08  6  7  1  9  four

### Setting

In [39]:
s1 = pd.Series((np.arange(12) + 1) * 10, index=pd.date_range("2022-10-06", periods=12, freq="6H"))
s1

2022-10-06 00:00:00     10
2022-10-06 06:00:00     20
2022-10-06 12:00:00     30
2022-10-06 18:00:00     40
2022-10-07 00:00:00     50
2022-10-07 06:00:00     60
2022-10-07 12:00:00     70
2022-10-07 18:00:00     80
2022-10-08 00:00:00     90
2022-10-08 06:00:00    100
2022-10-08 12:00:00    110
2022-10-08 18:00:00    120
Freq: 6H, dtype: int32

In [40]:
df["F"] = s1

In [41]:
df

                     A  B  C  D    F
2022-10-06 00:00:00  0  3  1  4   10
2022-10-06 12:00:00  2  9  2  9   30
2022-10-07 00:00:00  7  3  5  4   50
2022-10-07 12:00:00  1  2  5  8   70
2022-10-08 00:00:00  6  7  1  9   90
2022-10-08 12:00:00  7  0  3  3  110

In [42]:
df.iat[0, 0] = 42

In [43]:
df.loc[:, "D"] = np.array([5] * len(df))

In [44]:
df

                      A  B  C  D    F
2022-10-06 00:00:00  42  3  1  5   10
2022-10-06 12:00:00   2  9  2  5   30
2022-10-07 00:00:00   7  3  5  5   50
2022-10-07 12:00:00   1  2  5  5   70
2022-10-08 00:00:00   6  7  1  5   90
2022-10-08 12:00:00   7  0  3  5  110

In [45]:
df4 = df.copy()
df4[df4 > 5] = -df4
df4

                      A  B  C  D    F
2022-10-06 00:00:00 -42  3  1  5  -10
2022-10-06 12:00:00   2 -9  2  5  -30
2022-10-07 00:00:00  -7  3  5  5  -50
2022-10-07 12:00:00   1  2  5  5  -70
2022-10-08 00:00:00  -6 -7  1  5  -90
2022-10-08 12:00:00  -7  0  3  5 -110

## Missing data

Missing Data: https://pandas.pydata.org/docs/user_guide/missing_data.html#missing-data

In [46]:
df5 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"]) #? iloc처럼 positional 접근할 수 있는 인덱스는 못 넣는가?
df5.loc[dates[0]:dates[1], "E"] = 123 #? loc와 iloc을 섞어쓰는 것이 가능한가? mutable reference식의 접근이라서 copy를 반환하는 것은 의도한 setting을 수행할 수 없음
df5

                        A    B    C    D     F      E
2022-10-06 00:00:00  42.0  3.0  1.0  5.0  10.0  123.0
2022-10-06 12:00:00   2.0  9.0  2.0  5.0  30.0  123.0
2022-10-07 00:00:00   7.0  3.0  5.0  5.0  50.0    NaN
2022-10-07 12:00:00   1.0  2.0  5.0  5.0  70.0    NaN

In [47]:
df5.dropna(how="any") # drops any rows that have missing data(NaN)

                        A    B    C    D     F      E
2022-10-06 00:00:00  42.0  3.0  1.0  5.0  10.0  123.0
2022-10-06 12:00:00   2.0  9.0  2.0  5.0  30.0  123.0

In [48]:
df5.fillna(value=999)

                        A    B    C    D     F      E
2022-10-06 00:00:00  42.0  3.0  1.0  5.0  10.0  123.0
2022-10-06 12:00:00   2.0  9.0  2.0  5.0  30.0  123.0
2022-10-07 00:00:00   7.0  3.0  5.0  5.0  50.0  999.0
2022-10-07 12:00:00   1.0  2.0  5.0  5.0  70.0  999.0

In [49]:
df5.isna()

                         A      B      C      D      F      E
2022-10-06 00:00:00  False  False  False  False  False  False
2022-10-06 12:00:00  False  False  False  False  False  False
2022-10-07 00:00:00  False  False  False  False  False   True
2022-10-07 12:00:00  False  False  False  False  False   True

## Operations

Basic sections on Binary Ops: https://pandas.pydata.org/docs/user_guide/basics.html#basics-binop

### Stats

Operations in general exclude missing data(NaN).

In [50]:
df.mean()

A    10.833333
B     4.000000
C     2.833333
D     5.000000
F    60.000000
dtype: float64

In [51]:
df.mean(axis=1)

2022-10-06 00:00:00    12.2
2022-10-06 12:00:00     9.6
2022-10-07 00:00:00    14.0
2022-10-07 12:00:00    16.6
2022-10-08 00:00:00    21.8
2022-10-08 12:00:00    25.0
Freq: 12H, dtype: float64

In [52]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [53]:
s2 = pd.Series(s.to_numpy(), index=dates).shift(2)
s2

2022-10-06 00:00:00    NaN
2022-10-06 12:00:00    NaN
2022-10-07 00:00:00    1.0
2022-10-07 12:00:00    3.0
2022-10-08 00:00:00    5.0
2022-10-08 12:00:00    NaN
Freq: 12H, dtype: float64

In [54]:
df.sub(s2, axis="index")

                       A    B    C    D     F
2022-10-06 00:00:00  NaN  NaN  NaN  NaN   NaN
2022-10-06 12:00:00  NaN  NaN  NaN  NaN   NaN
2022-10-07 00:00:00  6.0  2.0  4.0  4.0  49.0
2022-10-07 12:00:00 -2.0 -1.0  2.0  2.0  67.0
2022-10-08 00:00:00  1.0  2.0 -4.0  0.0  85.0
2022-10-08 12:00:00  NaN  NaN  NaN  NaN   NaN

### Apply

`DataFrame.apply`

In [55]:
df

                      A  B  C  D    F
2022-10-06 00:00:00  42  3  1  5   10
2022-10-06 12:00:00   2  9  2  5   30
2022-10-07 00:00:00   7  3  5  5   50
2022-10-07 12:00:00   1  2  5  5   70
2022-10-08 00:00:00   6  7  1  5   90
2022-10-08 12:00:00   7  0  3  5  110

In [56]:
df.apply(np.cumsum)

                      A   B   C   D    F
2022-10-06 00:00:00  42   3   1   5   10
2022-10-06 12:00:00  44  12   3  10   40
2022-10-07 00:00:00  51  15   8  15   90
2022-10-07 12:00:00  52  17  13  20  160
2022-10-08 00:00:00  58  24  14  25  250
2022-10-08 12:00:00  65  24  17  30  360

In [57]:
df.apply(lambda x: x.max() - x.min())

A     41
B      9
C      4
D      0
F    100
dtype: int64

### Histogramming
Histogramming and Discretization: https://pandas.pydata.org/docs/user_guide/basics.html#basics-discretization

In [62]:
s = pd.Series(rg.integers(0, 5, size=10))
s

0    3
1    3
2    2
3    1
4    2
5    4
6    2
7    3
8    1
9    4
dtype: int64

In [63]:
s.value_counts()

3    3
2    3
1    2
4    2
dtype: int64

### String Methods %추가바람
Vectorized String Methods: https://pandas.pydata.org/docs/user_guide/text.html#text-string-methods

Series, Index의 각각의 string에 대해서 Series.str attribute를 통해 string 자체에 적용되는 메소드들 중 일부를 적용시킬 수 있음:  
`lower`, `upper`, `len`, `strip`, `lstrip`, `rstrip`, `replace`

#### Note
Series의 고유한 요소의 개수가 `Series`의 길이보다 작다면 `Series` 타입 대신 `category` 타입들 중 하나를 사용하는 것이 좋습니다.(더 빠름)  
`.str.<method>` 또는 `.dt.<property>` 방식으로 연산할 수 있습니다. %추가바람

In [64]:
pd.Series(["a", "b", "c"]).dtype

dtype('O')

In [67]:
s = pd.Series(["a", "b", "c"]).astype("string")
s

0    a
1    b
2    c
dtype: string

In [73]:
s.str.len()

0    1
1    1
2    1
dtype: Int64

In [81]:
# s.str
map(lambda x: x + "5", s.str)

## Merge

### Concat

Merging section: https://pandas.pydata.org/docs/user_guide/merging.html#merging

In [85]:
df = pd.DataFrame(rg.standard_normal((10, 4)))
df

          0         1         2         3
0  0.519870 -0.447166 -3.290950 -1.072487
1  0.553400  1.127442  0.452839 -0.153609
2  0.553243 -0.499706 -0.090818  0.185372
3  0.560412 -0.983437 -0.240149 -0.793523
4  0.713722 -0.533457  1.193221 -0.425676
5 -0.472577  0.978548 -0.585787  0.929303
6  0.462054 -0.474416 -0.731158 -1.615548
7 -0.784141 -0.644805  1.371997  0.004327
8 -0.032807  0.306193 -0.324505 -0.662039
9 -0.991646  0.743538 -0.037774 -0.314445

In [87]:
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0  0.519870 -0.447166 -3.290950 -1.072487
1  0.553400  1.127442  0.452839 -0.153609
2  0.553243 -0.499706 -0.090818  0.185372
3  0.560412 -0.983437 -0.240149 -0.793523
4  0.713722 -0.533457  1.193221 -0.425676
5 -0.472577  0.978548 -0.585787  0.929303
6  0.462054 -0.474416 -0.731158 -1.615548
7 -0.784141 -0.644805  1.371997  0.004327
8 -0.032807  0.306193 -0.324505 -0.662039
9 -0.991646  0.743538 -0.037774 -0.314445

#### Note
`DataFrame`의 column을 추가하는 것은 상대적으로 빠르지만, 새로운 row를 추가하는 것은 copy가 필요하며 비쌉니다.  
We recommend passing a pre-built list of records to the `DataFrame` constructor instead of building a `DataFrame` by iteratively appending records to it.

### Join
Database style joining: https://pandas.pydata.org/docs/user_guide/merging.html#merging-join

Enables SQL style join types along specific columns.

In [88]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [89]:
right= pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [91]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [92]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [93]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [94]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

## Grouping
Grouping: https://pandas.pydata.org/docs/user_guide/groupby.html#groupby

다음 steps들을 포함하고 있는 process입니다:  
* Splitting
* Applying
* Combining

In [97]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": rg.standard_normal(8),
        "D": rg.standard_normal(8),
    }
)
df

     A      B         C         D
0  foo    one -0.691640  0.433921
1  bar    one  0.317951  0.597557
2  foo    two  0.115362  0.075449
3  bar  three -0.632644  1.243430
4  foo    two -0.267114 -2.235583
5  bar    two  2.146114 -1.309015
6  foo    one -0.241407  0.085056
7  foo  three -0.748380 -1.022803

In [99]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  1.831421  0.531972
foo -1.833179 -2.663960

In [100]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    0.317951  0.597557
    three -0.632644  1.243430
    two    2.146114 -1.309015
foo one   -0.933047  0.518977
    three -0.748380 -1.022803
    two   -0.151752 -2.160134